;Head

[SamHead X2BodyPartTemplate]
DisplayName="Jetstream Sam Head"

;Body

[SamBody X2BodyPartTemplate]
DisplayName="Jetstream Sam Torso"

[SamBodyR X2BodyPartTemplate]
DisplayName="Jetstream Sam Torso"

[SamBodyK X2BodyPartTemplate]
DisplayName="Jetstream Sam Torso"

[SamBodyT X2BodyPartTemplate]
DisplayName="Jetstream Sam Torso"

;Arms

[SamArms X2BodyPartTemplate]
DisplayName="Jetstream Sam Arms"

[SamArmsR X2BodyPartTemplate]
DisplayName="Jetstream Sam Arms"

[SamArmsK X2BodyPartTemplate]
DisplayName="Jetstream Sam Arms"

[SamArmsT X2BodyPartTemplate]
DisplayName="Jetstream Sam Arms"

;Legs

[SamLegs X2BodyPartTemplate]
DisplayName="Jetstream Sam Legs"

[SamLegsR X2BodyPartTemplate]
DisplayName="Jetstream Sam Legs"

[SamLegsK X2BodyPartTemplate]
DisplayName="Jetstream Sam Legs"

[SamLegsT X2BodyPartTemplate]
DisplayName="Jetstream Sam Legs"

;TorsoDeco

[SamDeco X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches + Sheath"

[SamPouches X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches"

[SamSheath X2BodyPartTemplate]
DisplayName="Jetstream Sam Sheath"

[SamDecoR X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches + Sheath"

[SamPouchesR X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches"

[SamSheathR X2BodyPartTemplate]
DisplayName="Jetstream Sam Sheath"

[SamDecoK X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches + Sheath"

[SamPouchesK X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches"

[SamSheathK X2BodyPartTemplate]
DisplayName="Jetstream Sam Sheath"

[SamDecoT X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches + Sheath"

[SamPouchesT X2BodyPartTemplate]
DisplayName="Jetstream Sam Pouches"

[SamSheathT X2BodyPartTemplate]
DisplayName="Jetstream Sam Sheath"

;Visors

[SamVisor X2BodyPartTemplate]
DisplayName="Jetstream Sam Visor Open"

[SamVisor2 X2BodyPartTemplate]
DisplayName="Jetstream Sam Visor Closed"

;InvisHead

[SamInvisHead X2BodyPartTemplate]
DisplayName="Jetstream Sam Invisible Head"

[SamInvisHeadSkirmisher X2BodyPartTemplate]
DisplayName="Jetstream Sam Invisible Head"